[
    {
        "id": 1,
        "title": "Nasi Goreng",
        "category": ["Lunch","Breakfast"],
        "nationality": "Asian",
        "featured": "yes",
        "time": "10 Minutes",
        "img": "nasgor.png",
        "url": "detail.html",
        "desc": "Delicious fried rice recipes are always perfect for breakfast, lunch or dinner. Topped with eggs, shredded chicken, prawns, beef meatballs and fish balls, make this special fried rice recipe your new family favorite.",
        "serving": "1",
        "length": "6",
        "minutes": "10",
        "calories": "267",
        "bahan": ["Rice", "Garlic", "Egg", "Sweet Soy Sauce", "Salt", "White Pepper"],
        "cara": [
        "Heat oil over medium heat.",
        "Saute spices until fragrant.",
        "Add rice and egg, stir until smooth.",
        "Add sweet soy sauce, stir again until smooth.",
        "Remove from heat and serve with complementary fried rice."]
    },
    {
        "id": 2,
        "title": "Pancake",
        "category": ["Breakfast"],
        "nationality": "Western",
        "featured": "yes",
        "time": "30 Minutes",
        "img": "pancake.png",
        "url": "detail.html",
        "desc": "Pancakes or pancakes are cakes made from flour, eggs, sugar and milk. The ingredients are mixed with water to form a thick batter that is fried on a lightly greased flat pan. Once cooked, pancakes can be served while still warm or once cooled.",
        "serving": "4",
        "length": "7",
        "minutes": "30",
        "calories": "227",
        "bahan": [
            "100 gr of wheat flour",
            "2 tbsp of Sugar",
            "Salt",
            "1 tsp of Baking Powder",
            "1 Chicken Egg",
            "100 ml of Cow's Milk",
            "30 gr of Butter"],
        "cara": [
        "Mix the flour, sugar, salt, and baking powder. Mix well. Pour in egg mixture and liquid milk. Stir until the dough is well mixed and soft.",
        "Add melted butter. Stir well.",
        "Brush the pan with a little butter and heat it on the stove. Then pour 1 spoon of dough into the pan.",
        "Cook the pancake until the dough on the inside of the pan is golden yellow or brownish yellow. The sign, we will see the shape of bubbles above the dough, then the dough must be turned slowly. cook for a while and remove."]
    },
    {
        "id": 3,
        "title": "Spaghetti Bolognese",
        "category": ["Dinner"],
        "nationality": "Western",
        "time": "45 Minutes",
        "img": "spaget.png",
        "url": "detail.html",
        "desc": "Spaghetti bolognese is a popular classic pasta dish. It uses minced meat sauce with a blend of fresh and sour tomato sauce and pasta. Of the various types of sauces that are popular, one of them is bolognese sauce which is said to have originated in the city of Bologna, Italy. This meat and tomato sauce is also used for lasagna and tagilatelle, a wide flat pasta.",
        "serving": "3",
        "length": "18",
        "minutes": "45",
        "calories": "885",
        "bahan": [
            "250 gram of spaghetti",
            "2.5 liters of water",
            "3 tbsp of butter",
            "50 gr onion",
            "3 cloves garlic",
            "100 gr of button mushrooms",
            "300 gr of minced beef",
            "2 tbsp of tomato paste",
            "3 red tomatoes",
            "1 tsp of dried organo",
            "2 tsp of dried basil",
            "2 bayleaf leaves",
            "1/2 tsp of black peppercorns",
            "1 tsp of sugar",
            "2 tsp of salt",
            "250 ml of pasta cooking water",
            "50 gr of parmesan cheese",
            "10 basil leaves"],
        "cara": [
        "Bring water to a boil in a saucepan, boil spaghetti until soft 'al dente'. Drain and set aside 250 ml boiling water.",
        "Bolognese Sauce: Melt butter in a pan, sauté onion and garlic. Stir until wilted and fragrant.",
        "Add mushrooms and stir until browned.",
        "Add beef, stir until browned and cooked.",
        "Add tomato paste, tomato paste, organo, basil, bayleaf, pepper, sugar and salt.",
        "Pour pasta cooking water and add spaghetti, stirring until slightly dry.",
        "Remove from heat, serve warm with Parmesan cheese and fresh basil leaves.",
        "Serve warm."]
    },
    {
        "id": 4,
        "title": "Popcorn Caramel",
        "category": ["Snack"],
        "nationality": "Western",
        "featured": "yes",
        "time": "5 Minutes",
        "img": "pop.png",
        "url": "detail.html",
        "desc": "Pancakes or pancakes are cakes made from flour, eggs, sugar and milk. The ingredients are mixed with water to form a thick batter that is fried on a lightly greased flat pan. Once cooked, pancakes can be served while still warm or once cooled.",
        "serving": "2",
        "length": "5",
        "minutes": "5",
        "calories": "380",
        "bahan": [
            "1/2 cup of corn kernels",
            "1 glass of sugar",
            "125 g of butter",
            "1/4 glass of oil",
            "1/4 tsp salt"],
        "cara": [
        "Make popcorn as usual by heating butter and popcorn in a saucepan.", 
        "Prepare another pot to make the caramel.",
        "Heat the butter, salt and sugar in a saucepan over medium heat.", 
        "Once mixed, continue to heat until boiling.", 
        "Cook until golden in color, approximately 10 minutes.",
        "Once cooked, pour the caramel popcorn into the finished one and stir until evenly distributed."]
    },
    {
        "id": 5,
        "title": "Omelette",
        "category": ["Breakfast"],
        "nationality": "Western",
        "featured":"yes",
        "time": "5 Minutes",
        "img": "omellete.jpg",
        "url": "detail.html",
        "desc": "An omelette is a dish made by beating eggs and mixing them with additional ingredients such as cheese, vegetables, or meat, then frying until cooked. It is often served as a quick and easy breakfast or snack. Omelettes typically have a fluffy texture and a savory aroma, with flavor variations depending on the added ingredients.",
        "serving": "1",
        "length": "3",
        "minutes": "5",
        "calories": "227",
        "bahan": [
            "3 eggs, beaten",
            "1 tsp of cooking oil",
            "1 tbsp of butter"],
        "cara": [
        "Season the beaten eggs well with salt and pepper.",
        "Heat the oil and butter in a non-stick frying pan over a medium-low heat until the butter has melted and is foaming.",
        "Pour the eggs into the pan, tilt the pan ever so slightly from one side to another to allow the eggs to swirl and cover the surface of the pan completely.",
        "Let the mixture cook for about 20 seconds then scrape a line through the middle with a spatula.",
        "Tilt the pan again to allow it to fill back up with the runny egg. Repeat once or twice more until the egg has just set.",
        "At this point you can fill the omelette with whatever you like – some grated cheese, sliced ham, fresh herbs, sautéed mushrooms or smoked salmon all work well. Scatter the filling over the top of the omelette and fold gently in half with the spatula. Slide onto a plate to serve."
        ]
    },
    {
        "id": 6,
        "title": "Chicken Congee",
        "category": ["Breakfast"],
        "nationality": "Asian",
        "featured":"yes",
        "time": "60 Minutes",
        "img": "chicken congee.jpg",
        "url": "detail.html",
        "desc": "Chicken congee, also known as rice porridge or rice gruel, is a comforting and nourishing dish made by simmering rice in a flavorful chicken broth until it reaches a thick, creamy consistency. It is commonly enjoyed as a warm and soothing breakfast or meal, especially during cold weather or when feeling under the weather.",
        "serving": "1",
        "length": "10",
        "minutes": "60",
        "calories": "300",
        "bahan": [
            "1/4 rice cup of white rice",
            "2 1/2 cup of water",
            "3.5 g of ginger",
            "85 g of chicken ",
            "1/2 tsp of cornstarch",
            "1/4 tbsp of oyster sauce ",
            "0.13 tsp of chicken bouillon",
            "1/2 tbsp of vegetable oil",
            "1/2 pieces of green onion",
            "1/4 piece of cilantro"
        ],
        "cara": [
        "Wash the rice.",
        "Boil 2 cup of water for later, then chop the ginger into thin slices and then into thin strips.",
        "Chop a few strands of cilantro and green onion into small pieces.",
        "Cut the chicken into thin slices and place it in a bowl to marinate.",
        "Add oyster sauce, cornstarch, chicken bouillon, and water. Mix and massage the chicken and the marinade together for 30 seconds until there's no liquid left. Then, add vegetable oil to the bowl and mix it around for another 20 to 30 seconds.",
        "Pour the boiled water from earlier into a pot, set on high heat, and wait for the pot to boil before adding the rice.",
        "Once the pot (water only) is boiling, add the rice and stir it around a bit. Cover the pot (water and rice) and wait until it's boiling again.",
        "Once the pot is boiling again, cover the pot and let it cook at medium heat for 35 minutes.",
        "Set the stove to high heat, and slowly add the chicken over the course of 30 to 60 seconds, stirring constantly as you go. Stir the chicken around for another 1 to 2 minutes. Once the pot is boiling again, check to see that the chicken is cooked through.",
        "Add the strips of ginger, as well as chicken bouillon. Stir everything around for 20 to 30 seconds.",
        "Turn off the heat, and pour it into your bowl. Garnish with the green onions and cilantro."
        ]
    },
    {
        "id": 7,
        "title": "Banh Mi",
        "category": ["Lunch"],
        "nationality": "Asian",
        "featured":"yes",
        "time": "50 Minutes",
        "img": "banh mi.png",
        "url": "detail.html",
        "desc": "An airy and crunchy French-style baguette, stuffed with an every varying combination of meats, vegetables, and sauces.",
        "serving": "2",
        "length": "15",
        "minutes": "50",
        "calories": "657",
        "bahan": [
            "½ cup rice vinegar",
            "¼ cup white sugar",
            "¼ cup water",
            "¼ cup matchstick-cut carrots",
            "¼ cup peeled and matchstick-cut daikon radish",
            "¼ cup thinly sliced white onion",
            "1 skinless, boneless chicken breast half",
            "1 pinch garlic salt, or to taste",
            "1/2 pieces of green onion",
            "ground black pepper to taste",
            "1 (12 inch) French baguette",
            "4 tablespoons mayonnaise",
            "¼ cup thinly sliced cucumber",
            "1 tablespoon fresh cilantro leaves",
            "1 small jalapeño pepper, cut into 1/16-inch-thick matchsticks",
            "1 wedge lime"
        ],
        "cara": [
        "Combine rice vinegar, sugar, and water in a saucepan. Bring to a boil over medium heat, stirring until sugar has dissolved, about 1 minute. Allow the mixture to cool.",
        "Place carrot, radish, and onion in a bowl. Pour in cooled vinegar mixture and let marinate at least 30 minutes.",
        "While vegetables marinate, set an oven rack about 6 inches from the heat source and preheat the broiler. Lightly oil a slotted broiler pan.",
        "Sprinkle chicken breast with garlic salt and pepper.",
        "Place chicken on the prepared pan and broil, turning once, until browned and no longer pink in the center, about 6 minutes per side.",
        "Place chicken on a cutting board. Cut into bite-sized pieces.",
        "Slice baguette in half lengthwise. Pull out the soft center of the bread, leaving a cavity for the fillings.",
        "Lightly toast baguette under the broiler, 2 to 3 minutes.",
        "Drain off excess vinegar mixture after vegetables have marinated.",
        "To assemble the sandwich, spread each half of toasted baguette with mayonnaise. Layer chicken on the bottom half of the bread. Top with cucumber, drained pickled vegetables, cilantro, and jalapeño. Squeeze lime wedge over fillings and cover with top half of baguette.",
        "Cut into two 6-inch sandwiches to serve."
        ]
    },
    {
        "id": 8,
        "title": "Pad Thai",
        "category": ["Lunch"],
        "nationality": "Asian",
        "featured":"yes",
        "time": "45 Minutes",
        "img": "padthai.jpg",
        "url": "detail.html",
        "desc": "Pad Thai is a traditional Thai stir-fried noodle dish that is famous worldwide. It consists of rice noodles stir-fried with egg, bean sprouts, shallots, and garlic, which are then mixed with tamarind sauce, fish sauce, and other seasonings. Pad Thai is often garnished with chopped peanuts, lime wedges, and green onions, providing a balanced flavor profile of sweet, sour, salty, and spicy.",
        "serving": "6",
        "length": "13",
        "minutes": "45",
        "calories": "524",
        "bahan": [
            "1 (12 ounce) package rice noodles",
            "2 tbsp of butter",
            "1 pound of boneless, skinless chicken breast halves, cut into bite-sized pieces",
            "1/4 cup of vegetable oil",
            "4 eggs",
            "3 tbsp of white sugar",
            "2 tbsp of fish sauce",
            "1 tbsp of white wine vinegar",
            "1/8 tbsp of crushed red pepper",
            "2 cups of bean sprouts",
            "3 green onions, chopped",
            "1/4 cup of crushed peanuts",
            "1 lemon, cut into wedges"
        ],
        "cara": [
            "Gather all ingredients.",
            "Soak rice noodles in cold water until soft, 30 to 50 minutes. Drain and set aside.",
            "Meanwhile, heat butter in a wok; add chicken and sauté until browned. Remove chicken and set aside.",
           " Heat oil in the wok over medium-high heat. Crack eggs into hot oil and cook until firm. Stir in chicken and cook for 5 minutes.",
           " Add softened noodles, sugar, fish sauce, vinegar, and red pepper; mix well until noodles are tender. Adjust seasonings to taste.",
            "Stir bean sprouts into wok and cook for 3 minutes.",
           " Serve topped with green onions, crushed peanuts, and a wedge of lemon."
        ]
    },
    {
        "id": 9,
        "title": "Churros",
        "category": ["Snack"],
        "nationality": "Western",
        "time": "20 Minutes",
        "img": "churros.jpg",
        "url": "detail.html",
        "desc": "A churro is a cinnamon- and sugar-topped fried pastry dough stick with Spanish and Portuguese origins. Churros are similar to doughnuts, but they have ridges because they are piped out of a pastry bag. Because they are fried instead of baked, churros have a fluffy and tender interior with a satisfyingly crispy exterior.",
        "serving": "4",
        "length": "8",
        "minutes": "20",
        "calories": "1700",
        "bahan": [
            "1 cup water",
            "2 1/2 tablespoons white sugar",
            "1/2 teaspoon salt",
            "2 tablespoons vegetable oil",
            "1 cup all-purpose flour",
            "2 quarts oil for frying",
            "1/2 cup white sugar, or to taste",
            "1 teaspoon ground cinnamon"
        ],
        "cara": [
            "Combine water, 2 1/2 tablespoons sugar, salt, and 2 tablespoons vegetable oil in a small saucepan and place over medium heat. Bring to a boil and remove from the heat. Stir in flour, stirring until mixture forms a ball.",
            "Heat oil for frying in a deep fryer or deep pot to 375 degrees F (190 degrees C).",
            "Transfer dough to a sturdy pastry bag fitted with a medium star tip. Carefully pipe a few 5- to 6-inch strips of dough into the hot oil; work in batches so you don't crowd the fryer. Cook until golden; use a spider or slotted spoon to transfer churros to paper towels to drain.",
            "Combine 1/2 cup sugar and cinnamon. Roll drained churros in cinnamon and sugar mixture."
        ]
    }
]
